pmo-dataset/mermaid/51.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1((" ")) --> Task_1["Employee submits a\nvacation request"]
	Task_1 --> Task_2["Requirement is\nregistered"]
	Task_2 --> Task_3["Employee's\nsupervisor receive\nthe request"]
	Task_3 --> Task_4["Supervisor approve\nor reject the\nrequest"]
	Task_4 --> ExclusiveGateway_1{"X"}
	Task_6["Notification is\ngenerated to the HR\nRepresentative"] --> Task_7["HR Representative\ncomplete the\nrespective\nmanagement\nprocedures"]
	Task_7 --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1 -->|"rejected"| Task_5["Application is\nreturned to employee"]
	ExclusiveGateway_1 -->|"approved"| Task_6
	Task_5 --> Task_8["Employee can check\nrejection reasons"]
	Task_8 --> ExclusiveGateway_2
